# Data Frame Creation

In [ ]:
#Experiment no:5

In [ ]:
#Aim:To perform operation for creation of an data frame

In [2]:
#Name:Ziya Firdos
#Roll no:68
#sec:3A
#Subjict:ET1
#Date:25/08/25

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame([[10,15,20,16],[19,17,15,13],[15,19,17,14]],
                columns=["CD","DBMS","DSS","CAO"])

In [5]:
df

   CD  DBMS  DSS  CAO
0  10    15   20   16
1  19    17   15   13
2  15    19   17   14

In [7]:
df.shape

(3, 4)

In [8]:
df.size

12

df.ndim

In [11]:
df2=pd.DataFrame([[5,6,7,8]],
                columns=["CD","DBMS","DSS","CAO"])

In [12]:
df3=df.append(df2,ignore_index=True)

In [13]:
df3

   CD  DBMS  DSS  CAO
0  10    15   20   16
1  19    17   15   13
2  15    19   17   14
3   5     6    7    8

In [15]:
df3=df.append(df2)

In [16]:
df3

   CD  DBMS  DSS  CAO
0  10    15   20   16
1  19    17   15   13
2  15    19   17   14
0   5     6    7    8

# Adding Attribute (Columns) name DM

In [17]:
df3["DM"]=[12,15,17,19]

In [18]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    15   20   16  12
1  19    17   15   13  15
2  15    19   17   14  17
0   5     6    7    8  19

# Deleting Record Form DataFrame

In [19]:
df4=df3.drop(index=[1])

In [20]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    15   20   16  12
2  15    19   17   14  17
0   5     6    7    8  19

In [21]:
df4=df3.drop(index=[2])

In [22]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    15   20   16  12
1  19    17   15   13  15
0   5     6    7    8  19

In [24]:
df5=df3.drop(columns=["DM"])

In [25]:
df5

   CD  DBMS  DSS  CAO
0  10    15   20   16
1  19    17   15   13
2  15    19   17   14
0   5     6    7    8

In [27]:
#finding mean of DSS
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 14.75

In [28]:
#finding median of DSS
print("Median of DSS:",df5["DSS"].median())

Median of DSS: 16.0

In [29]:
#finding mode of DSS
print("Mode of DSS:",df5["DSS"].mode())

Mode of DSS: 0     7
1    15
2    17
3    20
dtype: int64

In [30]:
#finding min of DSS
print("Min of DSS:",df5["DSS"].min())

Min of DSS: 7

In [31]:
#finding max of DSS
print("Max of DSS:",df5["DSS"].max())

Max of DSS: 20

In [32]:
Name=["Shriram","Shrihari","Harshal","Kartik","Rohan"]
Name

['Shriram', 'Shrihari', 'Harshal', 'Kartik', 'Rohan']

In [33]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1     Shriram
2    Shrihari
3     Harshal
4      Kartik
5       Rohan
dtype: object

In [ ]:
Conclusion:-In this experiment, we successfully learned how to create and manipulate DataFrames using the Pandas library in Python.